# Задание со звёздочкой (не обязательно)
# 
# Доработаем мини-игру из задания 4.
# Добавьте систему способностей (skills) и прокачки персонажа.
# 
# Что сделать?
# 1 - Добавьте уровень (level) у персонажа.
#   При победе над врагом:
#       - уровень увеличивается
#       - запас здоровья и величина урона растут
# 
# 2 - Добавьте особую атаку, например:
def special_attack(self, other):
    # наносит больше урона, чем обычная

# 3 - Сделайте разные типы врагов, например:
#   Goblin - слабый, но быстрый
#   Orc - много хп
#   Boss - очень сильный
#   (реализуйте через наследование)

# Дополнительно:
# - шанс крита (критического удара)
# - лечение
# - система уровней (не прокачка персонажа, а именно разные уровни 
#   с разными противниками)
# - выбор действия игрока